In [108]:
import os
import sqlite3
import pandas as pd

In [94]:
print("CWD: ")
print(os.getcwd())

CWD:
c:\Users\Britt\Documents\Projects\capstone\notebooks

In [109]:
conn = sqlite3.connect("../track_jumps.db")

In [50]:
pd.read_sql(
    "SELECT name FROM sqlite_master WHERE type='table';",
    conn
)

                name
0    sqlite_sequence
1       dim_athletes
2         dim_events
3          dim_meets
4  fact_performances

#### How much data do I have by event and gender?
##### Based on the earlier exploration of the data (prior to cleaning), I have a general range to expect this data to fall.

In [56]:
query1 = """
SELECT 
    e.event_name, 
    e.gender, 
    count(*) AS performance_count 
FROM fact_performances f 
JOIN dim_events e 
    ON f.event_id = e.event_id 
GROUP BY e.event_name, e.gender 
ORDER BY performance_count DESC;
"""
    
pd.read_sql(query1, conn)

    event_name gender  performance_count
0    high jump      M               9861
1    long jump      M               9821
2  triple jump      M               8633
3  triple jump      F               7419
4    long jump      F               3981
5    high jump      F               3829

## Peak Performance Age by Event and Gender
#### At what age do athletes typically achieve their best performances? How does this differ by event and gender?
##### How I answered this question:
- Join fact_performance and dim_events
- Group by event and gender
- Calculate:
 - average age
 - youngest age
 - oldest age
##### _Athough this is not a true peak performance age, it does demonstrate where top performances appear in the data._

In [57]:
query2 = """
SELECT 
    e.event_name,
    e.gender,
    Round(AVG(f.age), 1) AS avg_age,
    MIN(f.age) AS youngest_age,
    COUNT(*) AS performances
FROM fact_performances f
JOIN dim_events e
    ON f.event_id = e.event_id
GROUP BY e.event_name, e.gender
ORDER BY avg_age;"""

pd.read_sql(query2, conn)

    event_name gender  avg_age  youngest_age  performances
0    long jump      M     24.3            11          9821
1    high jump      M     24.4            16          9861
2    high jump      F     25.1            15          3829
3  triple jump      M     25.1            15          8633
4    long jump      F     25.4            14          3981
5  triple jump      F     25.8            12          7419

# Elevation and Performance
#### Query 3 explores the effect altitude may have on performance. Elevation defined by the following criteria: Sea level 0m, Low Elevation <1000m, and High Elevation is ≥1000.

In [67]:
query3 = """
SELECT
    e.event_name,
    e.gender,
    CASE
        When m.elevation >= 1000 THEN 'High Elevation (≥1000m)'
        When m.elevation = 0 THEN 'Sea-level'
        ELSE 'Low Elevation (<1000m)'
    END AS elevation_group,
    ROUND(AVG(f.mark), 2) AS avg_mark,
    COUNT(*) AS performances
FROM fact_performances f
JOIN dim_events e
    ON f.event_id = e.event_id
JOIN dim_meets m
    ON f.meet_id = m.meet_id
GROUP BY e.event_name, e.gender, elevation_group;
"""

pd.read_sql(query3, conn)

     event_name gender          elevation_group  avg_mark  performances
0     high jump      F  High Elevation (≥1000m)      1.97           146
1     high jump      F   Low Elevation (<1000m)      1.97          3615
2     high jump      F                Sea-level      1.97            68
3     high jump      M  High Elevation (≥1000m)      2.29           328
4     high jump      M   Low Elevation (<1000m)      2.29          9289
5     high jump      M                Sea-level      2.29           244
6     long jump      F  High Elevation (≥1000m)      6.92           163
7     long jump      F   Low Elevation (<1000m)      6.89          3731
8     long jump      F                Sea-level      6.93            87
9     long jump      M  High Elevation (≥1000m)      8.17           684
10    long jump      M   Low Elevation (<1000m)      8.15          8900
11    long jump      M                Sea-level      8.14           237
12  triple jump      F  High Elevation (≥1000m)     14.34           302
13  triple jump      F   Low Elevation (<1000m)     14.32          6923
14  triple jump      F                Sea-level     14.27           194
15  triple jump      M  High Elevation (≥1000m)     17.08           353
16  triple jump      M   Low Elevation (<1000m)     17.08          8072
17  triple jump      M                Sea-level     17.08           208

Query 4 takes the previous query and adds the MAX and MIN performance averages at each elevation.

In [68]:
query4 = """
SELECT
    e.event_name,
    e.gender,
    CASE
        When m.elevation >= 1000 THEN 'High Elevation (≥1000m)'
        When m.elevation = 0 THEN 'Sea-level'
        ELSE 'Low Elevation (<1000m)'
    END AS elevation_group,
    ROUND(AVG(f.mark), 2) AS avg_mark,
    ROUND(MAX(f.mark), 2) AS best_mark,
    ROUND(MIN(f.mark), 2) AS low_mark,    
    COUNT(*) AS performances
FROM fact_performances f
JOIN dim_events e
    ON f.event_id = e.event_id
JOIN dim_meets m
    ON f.meet_id = m.meet_id
GROUP BY e.event_name, e.gender, elevation_group
HAVING COUNT (*) >=100
ORDER BY e.event_name, e.gender, elevation_group;
"""

pd.read_sql(query4, conn)

,event_name,gender,elevation_group,avg_mark,best_mark,low_mark,performances
0,high jump,F,High Elevation (≥1000m),1.97,2.06,1.92,146
1,high jump,F,Low Elevation (<1000m),1.97,2.09,1.90,3615
2,high jump,M,High Elevation (≥1000m),2.29,2.40,2.25,328
3,high jump,M,Low Elevation (<1000m),2.29,2.45,2.25,9289
4,high jump,M,Sea-level,2.29,2.38,2.25,244
5,long jump,F,High Elevation (≥1000m),6.92,7.63,6.59,163
6,long jump,F,Low Elevation (<1000m),6.89,7.49,6.55,3731
7,long jump,M,High Elevation (≥1000m),8.17,8.99,7.75,684
8,long jump,M,Low Elevation (<1000m),8.15,8.95,7.75,8900
9,long jump,M,Sea-level,8.14,8.60,7.76,237
10,triple jump,F,High Elevation (≥1000m),14.34,15.43,14.01,302
11,triple jump,F,Low Elevation (<1000m),14.32,15.74,14.00,6923
12,triple jump,F,Sea-level,14.27,15.11,14.00,194
13,triple jump,M,High Elevation (≥1000m),17.08,17.97,16.80,353
14,triple jump,M,Low Elevation (<1000m),17.08,18.43,16.62,8072
15,triple jump,M,Sea-level,17.08,17.82,16.80,208

Query 5 
Phase 1
Top 10 athletes that have competed at all levels (U18, U20, Senior)

In [ ]:
query_phase1 = """
WITH ranked_athletes AS (
    SELECT
        a.athlete_id,
        a.name AS athlete,
        e.event_name,
        e.gender,
        MAX(f.mark) AS best_mark
    FROM fact_performances f
    JOIN dim_athletes a
        ON f.athlete_id = a.athlete_id
    JOIN dim_events e
        ON f.event_id = e.event_id
    GROUP BY
        a.athlete_id,
        e.event_name,
        e.gender
)
SELECT *
FROM ranked_athletes
ORDER BY
    event_name,
    gender,
    best_mark DESC;
"""

pd.read_sql(query_phase1, conn)

      athlete_id                 athlete   event_name gender  best_mark
0          48008      Stefka KOSTADINOVA    high jump      F       2.09
1          48009         Kajsa BERGQVIST    high jump      F       2.08
2          48010           Blanka VLAŠIĆ    high jump      F       2.08
3          48011       Lyudmila ANDONOVA    high jump      F       2.07
4          48012            Heike HENKEL    high jump      F       2.07
...          ...                     ...          ...    ...        ...
3678       48002        Denis SAURAMBAEV  triple jump      M      16.80
3679       48003    Aliaksandr LIABEDZKA  triple jump      M      16.80
3680       48004  Mohammed Abbas DARWISH  triple jump      M      16.80
3681       48005            José BELLIDO  triple jump      M      16.80
3682       48006        Sergey TIMOFEYEV  triple jump      M      16.65

[3683 rows x 5 columns]

In [120]:
query_phase2 = """
WITH athlete_levels AS (
    SELECT
        f.athlete_id,
        e.event_name,
        e.gender,
        COUNT(DISTINCT f.age_group) AS age_levels
    FROM fact_performances f
    JOIN dim_events e
        ON f.event_id = e.event_id
    GROUP BY
        f.athlete_id,
        e.event_name,
        e.gender
    HAVING age_levels = 3
),
ranked_athletes AS (
    SELECT
        a.athlete_id,
        a.name AS athlete,
        e.event_name,
        e.gender,
        MAX(f.mark) AS best_mark
    FROM fact_performances f
    JOIN dim_athletes a
        ON f.athlete_id = a.athlete_id
    JOIN dim_events e
        ON f.event_id = e.event_id
    JOIN athlete_levels al
        ON al.athlete_id = f.athlete_id
        AND al.event_name = e.event_name
        AND al.gender = e.gender
    GROUP BY
        a.athlete_id,
        e.event_name,
        e.gender    
)
SELECT *
FROM ranked_athletes
ORDER BY 
    event_name,
    gender,
    best_mark DESC;
"""

pd.read_sql(query_phase2, conn)

    athlete_id                athlete   event_name gender  best_mark
0        48010          Blanka VLAŠIĆ    high jump      F       2.08
1        48007    Yaroslava MAHUCHIKH    high jump      F       2.06
2        48023          Alina ASTAFEI    high jump      F       2.04
3        48034        Marina KUPTSOVA    high jump      F       2.03
4        48035         Mariya KUCHINA    high jump      F       2.03
..         ...                    ...          ...    ...        ...
90       47471  Jordan A. DÍAZ FORTUN  triple jump      M      18.18
91       47475         Yoelbi QUESADA  triple jump      M      17.97
92       47436         Jaydon HIBBERT  triple jump      M      17.87
93       47488        Lázaro MARTÍNEZ  triple jump      M      17.71
94       47445              Junjie GU  triple jump      M      17.23

[95 rows x 5 columns]